[
  {
    "id": "00df7f2a-9ba5-4835-a09a-2b87c50c81ec",
    "title": "(Eco)Anxiety in Nuclear Holocaust Fiction and Climate Fiction",
    "authors": [
      "Dominika Oramus"
    ],
    "isbn": "9781000910254",
    "published_date": "2023-07-07",
    "page_count": 139,
    "description": "(Eco)Anxiety in Nuclear Holocaust Fiction and Climate Fiction: Doomsday Clock Narratives demonstrates that disaster fiction— nuclear holocaust and climate change alike— allows us to unearth and anatomise contemporary psychodynamics and enables us to identify pretraumatic stress as the common denominator of seemingly unrelated types of texts. These Doomsday Clock Narratives argue that earth’s demise is soon and certain. They are set after some catastrophe and depict people waiting for an even worse catastrophe to come. References to geology are particularly important— in descriptions of the landscape, the emphasis falls on waste and industrial bric- a- brac, which is seen through the eyes of a future, posthuman archaeologist. Their protagonists have the uncanny feeling that the countdown has already started, and they are coping with both traumatic memories and pretraumatic stress. Readings of novels by Walter M. Miller, Nevil Shute, John Christopher, J. G. Ballard, George Turner, Maggie Gee, Paolo Bacigalupi, Ruth Ozeki, and Yoko Tawada demonstrate that the authors are both indebted to a century- old tradition and inventively looking for new ways of expressing the pretraumatic stress syndrome common in contemporary society. This book is written for an academic audience (postgraduates, researchers, and academics) specialising in British Literature, American Literature, and Science Fiction Studies.",
    "google_books_id": "tNe-EAAAQBAJ",
    "cover_url": "https://books.google.com/books/content?id=tNe-EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "categories": [
      "Literary Criticism",
      "Science Fiction"
    ]
  },
  {
    "id": "02901e6f-94d3-4104-9fd8-e609e75b6af0",
    "title": "Summer of Lovecraft: Cosmic Horror in the 1960s",
    "authors": [
      "Lois H. Gresh"
    ],
    "isbn": "1626412928",
    "published_date": "2019-12-05",
    "page_count": 318,
    "description": "A new Lovecraftian anthology based in the 1960s from the editors behind World War Cthulhu: A Collection of Lovecraftian War Stories! Now available for preorder in ebook and to be delivered by September 2019.TABLE OF CONTENTSNight Trippers by Lois H. GreshBeing for the Benefit of Mr. Sullivan by Lee Clark ZumpeDreamland by David DunwoodyLost In the Poppy-Fields of Flesh by Konstantine ParadiasFive To One by Edward M. ErdelacKeeping the Faith by Sam StoneMud Men by Sean HoadeMisconception by Jamie D. JenkinsNo Colors Anymore by Joe L. MurrOperation Alice by Pete RawlikShimmer and Sway by Jayaprakash SatyamurthyShort Wave by Stephen Mark RaineyThe Song that Crystal Sang by Tom LynchThrough a Looking Glass Darkly by Glynn Owen Barrass and Brian M. SammonsThe Color from the Deep by William MeikleThe Long Fine Flash by Edward MorrisThe Summer of Love by C.J. HendersonJust Another Afternoon in Arkham, Brought to You in Living Color by Mark McLaughlin and Michael Sheehan, Jr.Crystal Blue Persuasion by Jeffrey Thomas",
    "google_books_id": "7KpdzAEACAAJ",
    "cover_url": "https://books.google.com/books/content?id=7KpdzAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "categories": [
      "Fiction"
    ]
  },
  {
    "id": "02bd1dc8-22dd-4727-b837-ea1096cc97d6",
    "title": "Blue-Green Rehabilitation",
    "authors": [
      "Philip Hayward"
    ],
    "isbn": "9781800625273",
    "published_date": "2025-06-30",
    "page_count": 194,
    "description": "In recent decades there has been a burgeoning interest in the development of blue-green corridors: areas where waterways are complemented by adjoining green spaces and related paths and leisure facilities. Urban planners have increasingly favoured such zones as a means of refreshing inner-city spaces. In many cases, such projects have involved the rehabilitation of former industrial and/or otherwise polluted waterways and adjacent land. These newly configured blue-green spaces have benefitted residents and provided a substantial attraction to tourists through in- and on- the water options (e.g., swimming, kayaking, fishing, cruise boat transit etc.), waterside relaxation and a range of riverbank activities. The establishment of managed green spaces has also seen the return of a variety of native species to such areas and the re-presentation of former waterside industrial features as heritage artefacts has also added value and appeal to such corridors. The anthology comprises nine international case studies that illustrate examples of best practice and/or the problems that can arise from such rehabilitations, such as gentrification (forcing housing prices up and dispersing established communities) and de-industrialisation that leads to reduced livelihood opportunities. Individual studies in the volume analyse the dynamics of neglect and rehabilitation, contrasting stakeholder agendas, destination branding and regional-national orientations. Collectively, the volume comprises an important reference point for future blue-green rehabilitation projects and the conclusion offers an agenda for the development of just and sustainable blue-green initiatives.",
    "google_books_id": "jHVsEQAAQBAJ",
    "cover_url": "https://books.google.com/books/content?id=jHVsEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "categories": [
      "Business & Economics",
      "Fantasy"
    ]
  },
  {
    "id": "03082e3d-3058-471b-a901-2956c1856f1e",
    "title": "Justice in Young Adult Speculative Fiction",
    "authors": [
      "Marek C. Oziewicz"
    ],
    "isbn": "9781317610816",
    "published_date": "2015-04-17",
    "page_count": 246,
    "description": "This book is the first to offer a justice-focused cognitive reading of modern YA speculative fiction in its narrative and filmic forms. It links the expansion of YA speculative fiction in the 20th century with the emergence of human and civil rights movements, with the communitarian revolution in conceptualizations of justice, and with spectacular advances in cognitive sciences as applied to the examination of narrative fiction. Oziewicz argues that complex ideas such as justice are processed by the human mind as cognitive scripts; that scripts, when narrated, take the form of multiply indexable stories; and that YA speculative fiction is currently the largest conceptual testing ground in the forging of justice consciousness for the 21st century world. Drawing on recent research in the cognitive and evolutionary sciences, Oziewicz explains how poetic, retributive, restorative, environmental, social, and global types of justice have been represented in narrative fiction, from 19th century folk and fairy tales through 21st century fantasy, dystopia, and science fiction. Suggesting that the appeal of these and other nonmimetic genres is largely predicated on the dream of justice, Oziewicz theorizes new justice scripts as conceptual tools essential to help humanity survive the qualitative leap toward an environmentally conscious, culturally diversified global world. This book is an important contribution to studies of children’s and YA speculative fiction, adding a new perspective to discussions about the educational as well as social potential of nonmimetic genres. It demonstrates that the justice imperative is very much alive in YA speculative fiction, creating new visions of justice relevant to contemporary challenges.",
    "google_books_id": "TX5KCAAAQBAJ",
    "cover_url": "https://books.google.com/books/content?id=TX5KCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "categories": [
      "Literary Criticism",
      "Science Fiction"
    ]
  },
  {
    "id": "033508ff-bb34-41d9-aef2-141f4ed8dc84",
    "title": "The Complete Nebula Award-winning Fiction",
    "authors": [
      "Samuel R. Delany"
    ],
    "isbn": "OCLC:1028567324",
    "published_date": "1986",
    "page_count": 425,
    "description": null,
    "google_books_id": "tMidtQEACAAJ",
    "cover_url": null,
    "categories": [
      "Science Fiction"
    ]
  },
  {
    "id": "04537132-0262-4928-90cc-3b1abdbf04c4",
    "title": "The Invisible Life of Addie LaRue",
    "authors": [
      "V. E. Schwab"
    ],
    "isbn": "9780765387561",
    "published_date": "2020-10-06",
    "page_count": 448,
    "description": "Cursed to be forgotten by everyone she meets, Addie LaRue strikes a bargain that spans centuries and challenges the meaning of a life well lived.",
    "google_books_id": "demo-book-6",
    "cover_url": "https://covers.openlibrary.org/b/id/10514838-L.jpg",
    "categories": [
      "Fantasy",
      "Historical Fiction"
    ]
  },
  {
    "id": "0482d088-1b9f-44c1-93d3-0678504c6e1b",
    "title": "The Fantasy and Necessity of Solidarity",
    "authors": [
      "Sarah Schulman"
    ],
    "isbn": "9780593854259",
    "published_date": "2025-04-22",
    "page_count": 321,
    "description": "From award-winning writer Sarah Schulman, a longtime social activist and outspoken critic of the Israeli war on Gaza, comes a brilliant examination of the inherent psychological and social challenges to solidarity movements, and what that means for the future For those who seek to combat injustice, solidarity with the oppressed is one of the highest ideals, yet it does not come without complication. In this searing yet uplifting book, award-winning writer and cultural critic Sarah Schulman delves into the intricate and often misunderstood concept of solidarity to provide a new vision for what it means to engage in this work—and why it matters. To grapple with solidarity, Schulman writes, we must recognize its inherent fantasies. Those being oppressed dream of relief, that a bystander will intervene though it may not seem to be in their immediate interest to do so, and that the oppressor will be called out and punished. Those standing in solidarity with the oppressed are occluded by a different fantasy: that their intervention is effective, that it will not cost them, and that they will be rewarded with friendship and thanks. Neither is always the case, and yet in order to realize our full potential as human beings in relation with others, we must continue to pursue action towards these shared goals. Within this framework, Schulman examines a range of case studies, from the fight for abortion rights in post-Franco Spain, to NYC’s AIDS activism in the 1990s, to the current wave of campus protest movements against Israel’s war on Gaza, and her own experience growing up as a queer female artist in male dominated culture industries. Drawing parallels between queer, Palestinian, feminist, and artistic struggles for justice, Schulman challenges the traditional notion of solidarity as a simple union of equals, arguing that in today's world of globalized power structures, true solidarity requires the collaboration of bystanders and conflicted perpetrators with the excluded and oppressed. That action comes at a cost, and is not always effective. And yet without it we sentence ourselves to a world without progressive change towards visions of liberation. By turns challenging, inspiring, pragmatic, and poetic, The Fantasy and Necessity of Solidarity provides a much-needed path for how we can work together to create a more just, more equitable present and future.",
    "google_books_id": "3msrEQAAQBAJ",
    "cover_url": "https://books.google.com/books/content?id=3msrEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "categories": [
      "Social Science",
      "Fantasy"
    ]
  },
  {
    "id": "04b43824-68d4-4ccb-bc3e-48570d9de19a",
    "title": "When I'm Gone",
    "authors": [
      "Abbi Glines"
    ],
    "isbn": "9781476776095",
    "published_date": "2015-04-07",
    "page_count": 272,
    "description": "\"A ... novel set in the fictional town of Rosemary Beach about a Texas rancher who falls in love with a housemaid at his rock star father's estate\"--",
    "google_books_id": "dba8BwAAQBAJ",
    "cover_url": "https://books.google.com/books/content?id=dba8BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "categories": [
      "Fiction",
      "Romance"
    ]
  },
  {
    "id": "05eaef7d-9e38-4e02-8fec-358dd2b16ed8",
    "title": "Nebula Award Stories Five",
    "authors": [
      "Science Fiction Writers of America"
    ],
    "isbn": "OCLC:8134990",
    "published_date": "1970",
    "page_count": 215,
    "description": null,
    "google_books_id": "NJFzGwAACAAJ",
    "cover_url": null,
    "categories": [
      "Science fiction",
      "Science Fiction"
    ]
  },
  {
    "id": "068a9286-750d-489b-8d68-b56825151747",
    "title": "Science Fiction",
    "authors": [
      "Isaac Asimov",
      "Greg Walz-Chojnacki",
      "Francis Reddy"
    ],
    "isbn": "0836812247",
    "published_date": "1995",
    "page_count": 38,
    "description": "This book compares science fiction with science fact.",
    "google_books_id": "O72EoPJN4mUC",
    "cover_url": "https://books.google.com/books/content?id=O72EoPJN4mUC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "categories": [
      "Juvenile Nonfiction",
      "Science Fiction"
    ]
  },
  {
    "id": "42b1a772-97a1-4777-97cb-ae30b66feab8",
    "google_books_id": "pZJ2H63MAioC",
    "title": "The Eye of the World",
    "authors": [
      "Robert Jordan"
    ],
    "description": "The Wheel of Time turns and Ages come and go, leaving memories that become legend. Legend fades to myth, and even myth is long forgotten when the Age that gave it birth returns again. When The Two Rivers is attacked by Trollocs-- a savage tribe of half-men, half-beasts-- five villagers flee that night into a world they barely imagined. They find new dangers waiting in the shadows and in the light. Rand al'Thor, an orphan, does not know that he is bound to the Wheel of Time-- and there are prophecies to be fulfilled. -- adapted from jacket",
    "cover_url": "https://books.google.com/books/content?id=pZJ2H63MAioC&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE71XynFESAbbJNO3Fw7UWDEt6ucEu1auAQD0s25U-w64wipDH-cixZH6G-gMtiW1EyxHV6v-K59QBB9WUc-SLn6kzfC3KcSmcDlQSSU00jL9VSdK3SxgAWJyFuzu78Cvdnqye5gw&source=gbs_api",
    "published_date": "1990-02-15",
    "page_count": 670,
    "categories": [
      "Fantasy",
      "Epic Fantasy"
    ],
    "isbn": "9780812500486"
  },
  {
    "id": "a22d3173-56b0-4aaf-850e-d594a74741d3",
    "google_books_id": "yngEsxEO4QYC",
    "title": "The Great Hunt",
    "authors": [
      "Robert Jordan"
    ],
    "description": "<p><b><i>The Wheel of Time</i> is now an original series on Prime Video, starring Rosamund Pike as Moiraine!<br><br>In <i>The Great Hunt</i>, the second novel in Robert Jordan’s #1 <i>New York Times</i> bestselling epic fantasy series, The Wheel of Time®, Rand al’Thor and his companions set out to retrieve a powerful artifact from The Dark One’s Shadowspawn.</b><br><br>For centuries, gleemen have told the tales of The Great Hunt of the Horn. So many tales about each of the Hunters, and so many Hunters to tell of...<br><br>Now the Horn itself is found: the Horn of Valere long thought only legend, the Horn which will raise the dead heroes of the ages.<br><br>And it is stolen.<br><br>In pursuit of the thieves, Rand al’Thor is determined to keep the Horn out of the grasp of The Dark One. But he has also learned that he is The Dragon Reborn—the Champion of Light destined to stand against the Shadow time and again. It is a duty and a destiny that requires Rand to uncover and master extraordinary capabilities he never imagined he possessed.<br><br>Since its debut in 1990, The Wheel of Time® has captivated millions of readers around the globe with its scope, originality, and compelling characters. The last six books in series were all instant #1 <i>New York Times</i> bestsellers, and <i>The Eye of the World</i> was named one of America's best-loved novels by PBS's The Great American Read.<br><br><b>The Wheel of Time®</b><br><i>New Spring: The Novel</i><br>#1 <i>The Eye of the World</i><br>#2 <i>The Great Hunt</i><br>#3 <i>The Dragon Reborn</i><br>#4 <i>The Shadow Rising</i><br>#5 <i>The Fires of Heaven</i><br>#6 <i>Lord of Chaos</i><br>#7 <i>A Crown of Swords</i><br>#8 <i>The Path of Daggers</i><br>#9 <i>Winter's Heart</i><br>#10 <i>Crossroads of Twilight</i><br>#11 <i>Knife of Dreams</i><br><br><b>By Robert Jordan and Brandon Sanderson</b><br>#12 <i>The Gathering Storm</i><br>#13 <i>Towers of Midnight</i><br>#14 <i>A Memory of Light</i><br><br><b>By Robert Jordan and Teresa Patterson</b><br><i>The World of Robert Jordan's The Wheel of Time</i><br><br><b>By Robert Jordan, Harriet McDougal, Alan Romanczuk, and Maria Simons</b><br><i>The Wheel of Time Companion</i><br><br><b>By Robert Jordan and Amy Romanczuk</b><br><i>Patterns of the Wheel: Coloring Art Based on Robert Jordan's The Wheel of Time</i><br><br>At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>",
    "cover_url": "https://books.google.com/books/content?id=yngEsxEO4QYC&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE70_Azr3z5bbE4e2MAForYW9MNQQdxip6TfWwhTltnPnL99OUMBHmTXPYfM76MQjeK4_vIgQJsfz5hT7RTWHiAQU6KgRp4lecABulT5izHFXEepH6AAByHlWB5MgpTzhxhv6Z9Hb&source=gbs_api",
    "published_date": "2009-11-17",
    "page_count": 624,
    "categories": [
      "Fantasy",
      "Epic Fantasy"
    ],
    "isbn": "9781429960137"
  },
  {
    "id": "13e4fad3-10ac-4d50-92e8-96e52827dec3",
    "google_books_id": "k9vI7-WwGmMC",
    "title": "Ender's Game",
    "authors": [
      "Orson Scott Card"
    ],
    "description": "<p><b>From <i>New York Times </i>bestselling author Orson Scott Card, <i>Ender's Game</i></b>—<b>adapted to film starring Asa Butterfield and Harrison Ford</b>—<b>is the classic Hugo and Nebula award-winning science fiction novel of a young boy's recruitment into the midst of an interstellar war.<br></b><br>In order to develop a secure defense against a hostile alien race's next attack, government agencies breed child geniuses and train them as soldiers. A brilliant young boy, Andrew \"Ender\" Wiggin lives with his kind but distant parents, his sadistic brother Peter, and the person he loves more than anyone else, his sister Valentine. Peter and Valentine were candidates for the soldier-training program but didn't make the cut—young Ender is the Wiggin drafted to the orbiting Battle School for rigorous military training.<br><br>Ender's skills make him a leader in school and respected in the Battle Room, where children play at mock battles in zero gravity. Yet growing up in an artificial community of young soldiers Ender suffers greatly from isolation, rivalry from his peers, pressure from the adult teachers, and an unsettling fear of the alien invaders. His psychological battles include loneliness, fear that he is becoming like the cruel brother he remembers, and fanning the flames of devotion to his beloved sister. <br><br>Is Ender the general Earth needs? But Ender is not the only result of the genetic experiments. The war with the Buggers has been raging for a hundred years, and the quest for the perfect general has been underway for almost as long. Ender's two older siblings are every bit as unusual as he is, but in very different ways. Between the three of them lie the abilities to remake a world. If, that is, the world survives.<br><br>Orson Scott Card's<i> Ender's Game</i> is the winner of the 1985 Nebula Award for Best Novel and the 1986 Hugo Award for Best Novel.<br><br>THE ENDER UNIVERSE<br><br>Ender series<br><i>Ender’s Game</i> /<i> Ender in Exile </i>/ <i>Speaker for the Dead </i>/ <i>Xenocide </i>/ <i>Children of the Mind</i><br><br>Ender’s Shadow series<br><i>Ender’s Shadow </i>/ <i>Shadow of the Hegemon </i>/ <i>Shadow Puppets </i>/ <i>Shadow of the Giant </i>/ <i>Shadows in Flight</i><br><br><i>Children of the Fleet</i><br><br>The First Formic War (with Aaron Johnston)<br><i>Earth Unaware </i>/ <i>Earth Afire </i>/ <i>Earth Awakens</i><br><br>The Second Formic War (with Aaron Johnston)<br><i>The Swarm </i>/<i>The Hive</i><br><br>Ender novellas<br><i>A War of Gifts </i>/<i>First Meetings</i></p>",
    "cover_url": "https://books.google.com/books/content?id=k9vI7-WwGmMC&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE73AF80tkXOCNuJsDDgXrc5a87s6CmnlRFPjcgZ67kVKs2XrfhDHRGnuWhlqZj6AJFobpUsdt7BkCsD8oGhyCYCflv_OeZ63hmjG8rz5FMgf9xwZuZ0ZzvgWJlNowUAWxwgO1Zpm&source=gbs_api",
    "published_date": "1991-08-15",
    "page_count": 226,
    "categories": [
      "Science Fiction",
      "Military SF"
    ],
    "isbn": "9780312932084"
  },
  {
    "id": "6f3452c6-e8c5-4328-941d-4992b401e7fe",
    "google_books_id": "GYi1s6OuY-sC",
    "title": "Speaker for the Dead",
    "authors": [
      "Orson Scott Card"
    ],
    "description": "<p>In the aftermath of his terrible war, Ender Wiggin disappeared, and a powerful voice arose: The Speaker for the Dead, who told the true story of the Bugger War.<br><br>Now, long years later, a second alien race has been discovered, but again the aliens' ways are strange and frightening...again, humans die. And it is only the Speaker for the Dead, who is also Ender Wiggin the Xenocide, who has the courage to confront the mystery...and the truth.<br><br><i>Speaker for the Dead</i>, the second novel in Orson Scott Card's The Ender Saga, is the winner of the 1986 Nebula Award for Best Novel and the 1987 Hugo Award for Best Novel.<br><br>THE ENDER UNIVERSE<br><br>Ender series<br><i>Ender’s Game</i> /<i> Ender in Exile </i>/ <i>Speaker for the Dead </i>/ <i>Xenocide </i>/ <i>Children of the Mind</i><br><br>Ender’s Shadow series<br><i>Ender’s Shadow </i>/ <i>Shadow of the Hegemon </i>/ <i>Shadow Puppets </i>/ <i>Shadow of the Giant </i>/ <i>Shadows in Flight</i><br><br><i>Children of the Fleet</i><br><br>The First Formic War (with Aaron Johnston)<br><i>Earth Unaware </i>/ <i>Earth Afire </i>/ <i>Earth Awakens</i><br><br>The Second Formic War (with Aaron Johnston)<br><i>The Swarm </i>/<i>The Hive</i><br><br>Ender novellas<br><i>A War of Gifts </i>/<i>First Meetings</i></p>",
    "cover_url": "https://books.google.com/books/content?id=GYi1s6OuY-sC&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE71OHvqF9rBmkaRbj_8qsF7rwFpgTj3kO374DMoaO_z_TV-9NLZ2nIE1sEPUBvpg0E_fAw3uSvaqmEa8gKJF-NDOP2FVR-4b5Ei8HvYUz3nMuvnsE9B67vLCZcyb0HFkvfE4rIJG&source=gbs_api",
    "published_date": "1992-08-15",
    "page_count": 280,
    "categories": [
      "Science Fiction"
    ],
    "isbn": "9780312853259"
  },
  {
    "id": "60eab8a3-98c7-4f63-8b81-208dd9fc8d86",
    "google_books_id": "6PRyEQAAQBAJ",
    "title": "Defiance of the Fall",
    "authors": [
      "TheFirstDefier"
    ],
    "description": "<p>Zac was alone in the middle of the forest when the world changed...</p><p><br></p><p>The whole planet was introduced to the multiverse by an unfeeling System... or God. A universe where an endless number of races and civilizations fought for power and dominion.</p><p><br></p><p>Zac finds himself stuck in the wilderness surrounded by deadly beasts, demons, and worse. Alone, lost and without answers, he must find the means to survive and get stronger in this new cut-throat reality.</p><p><br></p><p>With only a hatchet for his weapon, he'll have to seek out his family before the world collapses... or die trying.</p><p><br></p><p>Experience the start of the hit LitRPG series with over 20 Million views on Royal Road. For the first time, Defiance of the Fall is now available on Kindle, Kindle Unlimited, and Audible narrated by Pavi Prozcko.</p><p><br></p><p>About the Series: Jump into an apocalypse story that merges LitRPG elements with eastern cultivation. Class systems, skill systems, endless choices for progression, it has everything fans of the genre love. Explore a vast universe full of mystery, adventure, danger and even aliens; where even a random passer-by might hold the power of a god. Follow Zac as he struggles to stake out a unique path to power as a mortal in a world full of cultivators.</p>",
    "cover_url": "https://books.google.com/books/publisher/content?id=6PRyEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE72gI2a_X9H8DlZBsC-5MkFtoRc7CC6mvB-H1pPTc-XHahDRNAmAOwro01TZi4fHcxa-VoPzmDABUS_Q0lgcMEBn_hN5Yz6LdSf3_HciyYd0EhrPJwktAJGrM6vy2Rfn6Ns7kETP&source=gbs_api",
    "published_date": "2025-07-21",
    "page_count": 778,
    "categories": [
      "LitRPG",
      "Progression Fantasy"
    ],
    "isbn": ""
  },
  {
    "id": "661d7f73-dc36-4fd7-94c8-5fd6bba9bf16",
    "google_books_id": "1O-ODwAAQBAJ",
    "title": "Ascendance of a Bookworm: Part 1 Volume 1",
    "authors": [
      "Miya Kazuki"
    ],
    "description": "<p>A certain college girl who's loved books ever since she was a little girl dies in an accident and is reborn in another world she knows nothing about. She is now Myne, the sickly five-year-old daughter of a poor soldier. To make things worse, the world she's been reborn in has a very low literacy rate and books mostly don't exist. She'd have to pay an enormous amount of money to buy one.</p><p>Myne resolves herself: If there aren't any books, she'll just have to make them! Her goal is to become a librarian. This story begins with her quest to make books so she can live surrounded by them!</p><p>Dive into this biblio-fantasy written for book lovers and bookworms!</p>",
    "cover_url": "https://books.google.com/books/publisher/content?id=1O-ODwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE7374bJiQvs1hzQVWltFyJ3nUhiv-XCYeHm4mmudVxYuvkTvwf65Dxo61uCI_BcV07VHlma9piN1yx9yIo680J7YwSNhWGJmrl-oUC6DXY79bS-h9_yqR0Z7FZH_C-wk8kBfJdFw&source=gbs_api",
    "published_date": "2019-05-20",
    "page_count": 282,
    "categories": [
      "Light Novel",
      "Fantasy"
    ],
    "isbn": "9781718346000"
  },
  {
    "id": "aafd33c5-f1ee-4da5-ae61-7df49eed6b0f",
    "google_books_id": "royalroad-path-of-the-deathless",
    "title": "Delve (Path of the Deathless)",
    "authors": [
      "SenescentSoul"
    ],
    "description": "Delve is an isekai litrpg that follows an average guy who just happened to wake up in a forest one day. He wasn’t summoned to defeat the demon lord or to save the world or anything like that, at least as far as he can tell. The only creature there to greet him was a regular old squirrel. Soon enough, he meets other people, only to discover that he can’t speak the language, and that not everybody immediately trusts random pajama-wearing strangers they met in the middle of the wilderness. Things generally go downhill from there, at least until the blue boxes start appearing. Delve is a story about finding your way in a new, strange, and dangerous world. It’s about avoiding death, figuring out what the heck is going on, and trying to make some friends along the way. It’s not about getting home, so much as finding a new one. Did I mention that there will be math?",
    "cover_url": "https://www.royalroadcdn.com/public/covers-full/25225-delve.jpg",
    "published_date": "2018-05-01",
    "page_count": 0,
    "categories": [
      "LitRPG",
      "Progression Fantasy",
      "Isekai"
    ],
    "isbn": ""
  },
  {
    "id": "f8486671-601d-4267-9347-8e859a7cc35a",
    "google_books_id": "web-world-of-cultivation",
    "title": "World of Cultivation",
    "authors": [
      "Fang Xiang"
    ],
    "description": "World of Cultivation is the tale of a disgruntled young man and his quest to be the best farmer he can be, at least if it wasn’t for those annoying people who keep getting in the way of his pursuit of agricultural excellence. Will conspiring forces turn him into a sword cultivator, or will he manage to throw off the shackles of fate and grow the best darn crops in the sect? Those air-headed cultivators dream of too much nonsense and don’t know how to live properly, they need to get a real job to earn some jingshi for a living like a normal person.",
    "cover_url": "https://novelfull.com/uploads/thumbs/world-of-cultivation-cb76fd4183-2239c49aee6b961904acf173b7e4602a.jpg",
    "published_date": "2010-06-01",
    "page_count": 0,
    "categories": [
      "Xianxia",
      "Cultivation",
      "Fantasy"
    ],
    "isbn": ""
  },
  {
    "id": "25722ee3-1244-4d3d-bf6b-6d1af5a0e8d1",
    "google_books_id": "v-RwEAAAQBAJ",
    "title": "Tower of God Volume One",
    "authors": [
      "S.I.U.",
      "S I U"
    ],
    "description": "<p>Twenty-Fifth Bam must journey skyward in a mysterious tower if he has any chance of reuniting with his best friend Rachel, even if that means facing his own death. <br><br>Before mysteriously disappearing into the tower gates before his very eyes, Rachel cautions Bam to forget all about her. Unwilling to lose her, Bam enters the Tower completely surrounded by Shinsu — a divine and magical water, at his own peril.<br><br>The Tower itself contains multitudes of floors as vast as continents, each one with its unique geography, language and culture. Confronted by skillful tests each step of the way, Bam meets powerful guardians and otherworldly environments, making his quest to the top no easy feat. <br><br>Beginning his journey, Bam is met by Headon, the first floor guardian and caretaker of the Tower who explains the rules of the Tower. At each level Bam is constantly tested for his strength, dexterity and wit. With help from fellow travelers and unlikely villains, Bam makes both allies and enemies in order to find Rachel; however her intentions of reconnecting with him become unclear as misinformation about her whereabouts do not add up. Behind each ascension is a revelation about their friendship, revealing a much deeper, darker secret.</p>",
    "cover_url": "https://books.google.com/books/publisher/content?id=v-RwEAAAQBAJ&printsec=frontcover&img=1&zoom=1&imgtk=AFLRE73D4ORCcqrUwR55BlxC6ML0PK4cgpGSlSVmhdxgGFwHRwfpWbLAIB2AyVMUWwjdLczRexYuPwTAfIDSsoAJFriMzDD6LFUp_XW3Hu_6nNIMlZEIrRXcOcW7Y8FCXFb-5H-HtZI4&source=gbs_api",
    "published_date": "2022-11-22",
    "page_count": 288,
    "categories": [
      "Webtoon",
      "Fantasy",
      "Action"
    ],
    "isbn": "9781990259906"
  },
  {
    "id": "a5630692-6cf1-4d8c-b834-970b18fbabe5",
    "google_books_id": "nrRKDwAAQBAJ",
    "title": "Dune",
    "authors": [
      "Frank Herbert"
    ],
    "description": "<b><b>Frank Herbert’s classic masterpiece—a triumph of the imagination and one of the bestselling science fiction novels of all time.</b></b><br><br>Set on the desert planet Arrakis, <i>Dune</i> is the story of Paul Atreides—who would become known as Muad'Dib—and of a great family's ambition to bring to fruition mankind's most ancient and unattainable dream.<br><br>A stunning blend of adventure and mysticism, environmentalism and politics, <i>Dune</i> won the first Nebula Award, shared the Hugo Award, and formed the basis of what is undoubtedly the grandest epic in science fiction.",
    "cover_url": "https://books.google.com/books/publisher/content?id=nrRKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE72NCnV0F9-rdKYEXhuQXxSN0jIZaiE6bZia9x9SEnfNrvXT42Tt2ruHVxm4PQc3eJheu10d1GWz6FDho3jZFnZG9xV2Eb-EXBeT35Qbk7zk-BG889DGMI4qwaIvLhy09_1LDv3u&source=gbs_api",
    "published_date": "1990-09-01",
    "page_count": 896,
    "categories": [
      "Science Fiction",
      "Space Opera"
    ],
    "isbn": "9780441172719"
  }
]